In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
# seaborn 디폴트 설정 
sns.set()

In [3]:
train = pd.read_csv("data/titanic/train.csv")
test = pd.read_csv("data/titanic/test.csv")

In [4]:
train_test_data = [train, test]

In [5]:
for dataset in train_test_data:
    dataset["title"] = train.Name.str.extract(" ([A-za-z]+)\.")

In [6]:
pd.crosstab(train["title"], train["Sex"])
# train,groupby(["Title","Sex"]).size().unstack().fillna(0)

Sex       female  male
title
Capt           0     1
Col            0     2
Countess       1     0
Don            0     1
Dr             1     6
Jonkheer       0     1
Lady           1     0
Major          0     2
Master         0    40
Miss         182     0
Mlle           2     0
Mme            1     0
Mr             0   517
Mrs          125     0
Ms             1     0
Rev            0     6
Sir            0     1

In [7]:
for dataset in train_test_data:
    dataset['title']=dataset['title'].replace('Mlle','Miss')
    dataset['title']=dataset['title'].replace('Ms','Miss')
    dataset['title']=dataset['title'].replace('Mme','Mrs')
    dataset['title']=dataset['title'].replace('Lady','Mrs')    
    dataset['title']=dataset['title'].replace(['Countess','Don', 'Sir', 'Jonkheer',
                                               'Capt','Major','Col','Rev','Dr'],'Other')

In [8]:
dataset["title"].isnull().sum()

0

In [9]:
pd.crosstab(train["title"], train["Sex"])

Sex     female  male
title
Master       0    40
Miss       185     0
Mr           0   517
Mrs        127     0
Other        2    20

In [10]:
train[["title", "Survived"]].groupby(["title"]).mean()

        Survived
title
Master  0.575000
Miss    0.702703
Mr      0.156673
Mrs     0.795276
Other   0.318182

In [11]:
title_mapping={"Mr":1,
              "Miss":2,
              "Mrs":3,
              "Master":4,
              "Other":5}

for dataset in train_test_data:
    dataset['title']=dataset['title'].map(title_mapping)
    dataset['title']=dataset['title'].fillna(0)

In [12]:
train["title"].isnull().sum()

0

In [13]:
for dataset in train_test_data:
    dataset["Sex"] = dataset["Sex"].map({"female" : 1, "male" : 0})

In [14]:
train.head()
test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,title
0,892,3,"Kelly, Mr. James",0,34.5,0,0,330911,7.8292,NaN,Q,1
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",1,47.0,1,0,363272,7.0000,NaN,S,3
2,894,2,"Myles, Mr. Thomas Francis",0,62.0,0,0,240276,9.6875,NaN,Q,2
3,895,3,"Wirz, Mr. Albert",0,27.0,0,0,315154,8.6625,NaN,S,3
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",1,22.0,1,1,3101298,12.2875,NaN,S,1

In [15]:
for dataset in train_test_data:
    dataset["Embarked"] = dataset.Embarked.fillna("S")
    dataset["Embarked"] = dataset["Embarked"].map({"S" : 1, "C" : 0, "Q" : 2})

In [16]:
train["Age"].isnull().sum()
# 결측치

177

In [17]:
train["Ageband"] = pd.cut(train["Age"], 5)
train[["Ageband", "Survived"]].groupby(["Ageband"], as_index = False).mean()

            Ageband  Survived
0    (0.34, 16.336]  0.550000
1  (16.336, 32.252]  0.369942
2  (32.252, 48.168]  0.404255
3  (48.168, 64.084]  0.434783
4    (64.084, 80.0]  0.090909

In [18]:
for dataset in train_test_data:
    dataset["Age"] = dataset.groupby(dataset.Pclass).Age.transform(lambda x: x.fillna(x.mean()))

In [19]:
for dataset in train_test_data:
    dataset.loc[(dataset["Age"] > 16) & (dataset["Age"] <= 32), "Age"] = 1
    dataset.loc[(dataset["Age"] > 32) & (dataset["Age"] <= 48), "Age"] = 2
    dataset.loc[(dataset["Age"] > 48) & (dataset["Age"] <= 64), "Age"] = 3
    dataset.loc[dataset["Age"] > 64, "Age"] = 4

In [20]:
for dataset in train_test_data:
    dataset['Fare']=dataset["Fare"].fillna(train["Fare"].median())

In [21]:
test["Fare"].isnull().sum()

0

In [22]:
# pd.cut 동일 길이로 나누워서 범주화
# pd.qcut 동일 갯수로 나누워서 범주화

In [23]:
train["Fareband"] = pd.qcut(train["Fare"], 4)
train[["Fareband", "Survived"]].groupby(["Fareband"], as_index = False).mean()

          Fareband  Survived
0   (-0.001, 7.91]  0.197309
1   (7.91, 14.454]  0.303571
2   (14.454, 31.0]  0.454955
3  (31.0, 512.329]  0.581081

In [24]:
for dataset in train_test_data:
    dataset.loc[dataset['Fare']<=7.91,'Fare']=0
    dataset.loc[(dataset['Fare']>7.91) & (dataset['Fare']<=14.454),'Fare']=1
    dataset.loc[(dataset['Fare']>14.454) & (dataset['Fare']<= 31.0),'Fare']=2
    dataset.loc[(dataset['Fare']>= 31.0) ,'Fare']=3
    dataset['Fare']=dataset['Fare'].astype(int)

In [25]:
for dataset in train_test_data:
    dataset["FamilySize"] = dataset["SibSp"] + dataset["Parch"] + 1

In [26]:
train[["FamilySize", "Survived"]].groupby(["FamilySize"], as_index = False).mean()

   FamilySize  Survived
0           1  0.303538
1           2  0.552795
2           3  0.578431
3           4  0.724138
4           5  0.200000
5           6  0.136364
6           7  0.333333
7           8  0.000000
8          11  0.000000

In [27]:
for dataset in train_test_data:
    dataset["IsAlone"] = 0 #혼자 아님 default
    dataset.loc[dataset["FamilySize"] == 1, "IsAlone"] = 1

In [28]:
train[["IsAlone", "Survived"]].groupby(["IsAlone"], as_index = False).mean()

   IsAlone  Survived
0        0  0.505650
1        1  0.303538

In [29]:
train.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked', 'title', 'Ageband',
       'Fareband', 'FamilySize', 'IsAlone'],
      dtype='object')

In [30]:
for dataset in train_test_data:
    dataset["Cabin"] = dataset["Cabin"].str.slice(0,1)
    dataset["Cabin"] = dataset["Cabin"].fillna("N")
    dataset["Cabin"] = dataset["Cabin"].astype("category")

In [31]:
pd.crosstab(train["Cabin"], train["Fare"])

Fare     0    1    2   3
Cabin
A        1    0    4  10
B        3    0    5  39
C        0    0   13  46
D        0    4    5  24
E        0    7    8  17
F        4    3    4   2
G        0    2    2   0
N      215  201  188  83
T        0    0    0   1

In [32]:
for dataset in train_test_data:
        dataset["Cabin"] = dataset.loc[(dataset['Cabin'] == "N") & (dataset['Fare'] == "0"),'Cabin'] = "G"
        dataset["Cabin"] = dataset.loc[(dataset['Cabin'] == "N") & (dataset['Fare'] == "1"),'Cabin'] = "E"
        dataset["Cabin"] = dataset.loc[(dataset['Cabin'] == "N") & (dataset['Fare'] == "2"),'Cabin'] = "C"
        dataset["Cabin"] = dataset.loc[(dataset['Cabin'] == "N") & (dataset['Fare'] == "3"),'Cabin'] = "A"

/Users/elie/opt/anaconda3/lib/python3.8/site-packages/pandas/core/ops/array_ops.py:253: FutureWarning: elementwise comparison failed; returning scalar instead, but in the future will perform elementwise comparison
  res_values = method(rvalues)

In [33]:
for dataset in train_test_data:
    dataset["Cabin"] = dataset.loc[(dataset['Cabin'] == "A") & (dataset['Cabin'] == "B"),'Cabin']=0
    dataset["Cabin"] = dataset.loc[(dataset['Cabin'] == "C") & (dataset['Cabin'] == "D"),'Cabin']=1
    dataset["Cabin"] = dataset.loc[(dataset['Cabin'] == "E") & (dataset['Cabin'] == "F"),'Cabin']=2
    dataset["Cabin"] = dataset.loc[(dataset['Cabin'] == "G") & (dataset['Cabin'] == "T"),'Cabin']=3
    dataset['Cabin']=dataset['Cabin'].astype(int)

In [34]:
train["Cabin"].isnull().sum()

0

# Random Forest

In [35]:
features_drop = ["Name", 'SibSp','Parch', "Cabin",'Ticket','FamilySize']
train = train.drop(features_drop, axis = 1)
train = train.drop(['PassengerId', "Ageband","Fareband"], axis = 1)
test = test.drop(features_drop, axis = 1)

In [36]:
xTrain=train.drop('Survived', axis=1)
yTrain=train['Survived']
xTest=test.drop('PassengerId', axis=1).copy()
xTrain.shape, yTrain.shape, xTest.shape

((891, 7), (891,), (418, 7))

In [37]:
from sklearn.tree import DecisionTreeClassifier

In [38]:
model = DecisionTreeClassifier()
model.fit(xTrain, yTrain)

DecisionTreeClassifier()

In [39]:
round(model.score(xTrain, yTrain)*100, 2)

87.32

In [40]:
y_pred_dt = model.predict(xTest)

In [42]:
mysubmit = pd.DataFrame({
    "PassengerId" : test["PassengerId"],
    "Survived" : y_pred_dt})
mysubmit.to_csv("mysub31.csv", index = False)